#+TITLE: #84: Cleanup Apisnoop Box
#+AUTHOR: Zach Mandeville
#+AUTHOR: Hippie Hacker
#+EMAIL: zz@ii.coop
#+EMAIL: hh@ii.coop
#+DATE: 30th of January, 2019
#+CREATOR: ii.coop
#+PROPERTY: header-args:shell :results output code verbatim replace
#+PROPERTY: header-args:shell+ :prologue "exec 2>&1\n"
#+PROPERTY: header-args:shell+ :epilogue ":\n"
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE :noeval t"
#+PROPERTY: header-args:shell+ :dir (symbol-value 'org-file-dir)
#+PROPERTY: header-args:shell+ :var TMATE_SOCKET=(symbol-value 'socket)
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (concat (user-login-name) ":" (nth 4 (org-heading-components)))
<<<<<<< HEAD
#+NOPROPERTY: header-args:tmate+ :prologue (concat "cd " org-file-dir "\n")
=======
#+PROPERTY: header-args:tmate+ :prologue (concat "cd " org-file-dir "\n")
>>>>>>> a5538b60c7b9f0c906630f5072cc881796f3d936
#+STARTUP: showeverything

** root
=======

>>>>>>> a5538b60c7b9f0c906630f5072cc881796f3d936
#+NAME ssh
#+BEGIN_SRC elisp
(set (make-local-variable 'ssh-host) "root@dev.apisnoop.cncf.ci")
(set (make-local-variable 'start-ssh-command) (concat "ssh -ttA -L " socket ":" socket " " ssh-host))
(set (make-local-variable 'start-tmate-command) (concat "tmate -S " socket " new-session -A -s " user-login-name " -n main "))
(gui-select-text (concat start-ssh-command " " start-tmate-command))
#+END_SRC

#+RESULTS:
<<<<<<< HEAD
: ssh -ttA -L /tmp/zz.84_cleanup-apisnoop-box.iisocket:/tmp/zz.84_cleanup-apisnoop-box.iisocket root@dev.apisnoop.cncf.ci tmate -S /tmp/zz.84_cleanup-apisnoop-box.iisocket new-session -A -s zz -n main 
=======
: ssh -ttA -L /tmp/hh.84_cleanup-apisnoop-box.diisocket:/tmp/hh.84_cleanup-apisnoop-box.diisocket root@dev.apisnoop.cncf.ci tmate -S /tmp/hh.84_cleanup-apisnoop-box.diisocket new-session -A -s hh -n main 
>>>>>>> a5538b60c7b9f0c906630f5072cc881796f3d936

#+NAME retrieve ssh-string
#+BEGIN_SRC elisp
;\"tmate wait tmate-ready && bash --login\"
(set (make-local-variable 'get-tmate-command) (concat "ssh -tA " ssh-host " tmate -S " socket " \"wait tmate-ready \\; display -p '#{tmate_ssh}'\" | xclip -i -sel p -f | xclip -i -sel c"))
(gui-select-text get-tmate-command)
#+END_SRC

#+RESULTS:
<<<<<<< HEAD
: ssh -tA root@dev.apisnoop.cncf.ci tmate -S /tmp/zz.84_cleanup-apisnoop-box.iisocket "wait tmate-ready \; display -p '#{tmate_ssh}'" | xclip -i -sel p -f | xclip -i -sel c
** web
 #+NAME webssh
 #+BEGIN_SRC elisp
 (set (make-local-variable 'web-socket) (concat socket ".zweb"))
 (set (make-local-variable 'ssh-host) "web@dev.apisnoop.cncf.ci")
 (set (make-local-variable 'start-ssh-command) (concat "ssh -ttA -L " web-socket ":" web-socket " " ssh-host))
 (set (make-local-variable 'start-tmate-command) (concat "tmate -S " web-socket " new-session -A -s " user-login-name " -n main "))
 (gui-select-text (concat start-ssh-command " " start-tmate-command))
 #+END_SRC

 #+RESULTS:
 : ssh -ttA -L /tmp/zz.84_cleanup-apisnoop-box.iisocket.zweb:/tmp/zz.84_cleanup-apisnoop-box.iisocket.zweb web@dev.apisnoop.cncf.ci tmate -S /tmp/zz.84_cleanup-apisnoop-box.iisocket.zweb new-session -A -s zz -n main 

 #+NAME retrieve ssh-string
 #+BEGIN_SRC elisp
 ;\"tmate wait tmate-ready && bash --login\"
 (set (make-local-variable 'get-tmate-command) (concat "ssh -tA " ssh-host " tmate -S " web-socket " \"wait tmate-ready \\; display -p '#{tmate_ssh}'\" | xclip -i -sel p -f | xclip -i -sel c"))
 (gui-select-text get-tmate-command)
 #+END_SRC

 #+RESULTS:
 : ssh -tA web@dev.apisnoop.cncf.ci tmate -S /tmp/zz.84_cleanup-apisnoop-box.iisocket.zweb "wait tmate-ready \; display -p '#{tmate_ssh}'" | xclip -i -sel p -f | xclip -i -sel c
